---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FamilyInstance..::..FromRoom Property
FamilyInstance Class See Also Send Feedback
---

The "From Room" set for the door or window.

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | FromRoom | The "From Room" set for the door or window in the last phase of the project. |
|  | [FromRoom[([( Phase])]) ](c4a37990-0603-50e0-ca97-1cd5449940dd.md) |  |

# See Also

FamilyInstance Class

FamilyInstance Members

Autodesk.Revit.DB Namespace